app/controllers/admins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authority" = ?  [["authority", "admin"]]
---
  def index
    @admins = User.where(:authority => 'admin')

INSERT INTO "users" ("email", "name", "password_digest", "authority") VALUES (?, ?, ?, ?)  [["email", "123@12345"], ["name", "123"], ["password_digest", "$2a$10$dBkgBFKCzYvcmjlhBx/tae/6EsdZMolKa/dTw/GzpL4JTHF160fNe"], ["authority", "admin"]]
---
  def create
    @admin = User.new(admin_params)
    @admin.authority = 'admin'
    respond_to do |format|
      if @admin.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
  def set_admin
    @admin = User.find(params[:id])