app/controllers/admins_controller.rb

  def index
    @admins = User.all
---
SELECT "users".* FROM "users"