app/controllers/cars_controller.rb

  def index_reserve
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"