app/controllers/cars_controller.rb

  def index
    if params[:car].nil?
      return @cars = Car.all
---
SELECT "cars".* FROM "cars"

  def edit_reserve
    id = params[:id]
    @reservation = Reservation.find(id)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]

  def update_reserve
    customer_email = params[:reservation][:email]
    car_lpn = params[:reservation][:lpn]
    @reservation = Reservation.where(email: customer_email).where(lpn: car_lpn).where(status: "Reserved").first
    respond_to do |format|
      if @reservation.update(reservation_params)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."email" = ? AND "reservations"."lpn" = ? AND "reservations"."status" = ? ORDER BY "reservations"."id" ASC LIMIT ?  [["email", "123@123"], ["lpn", "567"], ["status", "Reserved"], ["LIMIT", 1]]
UPDATE "reservations" SET "expect_start_time" = ?, "expect_return_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["expect_start_time", "2017-09-30 14:21:00"], ["expect_return_time", "2017-09-30 15:21:00"], ["updated_at", "2017-10-02 14:35:41.097104"], ["id", 67]]

  def index_reserve
    @reservations = Reservation.all.order(id: :desc)
---
SELECT "reservations".* FROM "reservations" ORDER BY "reservations"."id" DESC

  def new_reserve
    if params[:reserve]
      email = params[:reserve][:email]
      @reservation1 = Reservation.where(email: email).where(status: ["Checkout", "Reserved"])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ? AND "reservations"."status" IN ('Checkout', 'Reserved')  [["email", "abc@abc"]]

  def create_reserve
    @reservation = Reservation.new(reservation_params)
    respond_to do |format|
      user = User.find_by_email(@reservation.email)
      if !user
        format.html {redirect_to reserve_path(:reserve => {:lpn => @reservation.lpn}), notice: 'Customer does not exist'}
      else
        @reservation1 = Reservation.where(email: user.email).where(status: ["Checkout", "Reserved"])
        if @reservation1 != []
          format.html {redirect_to cars_url, notice: "The customer already has one reservation."}
        end
      end

      if user && @reservation1 == [] && @reservation.save
        checkout_timer @reservation.expect_start_time, @reservation.id, @reservation.lpn
        @car = Car.find_by_lpn(@reservation.lpn)
        if @car.status == "Available"
          @car.status = "Reserved"
          @car.update_attribute(:status, "Reserved")
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "2@2"], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ? AND "reservations"."status" IN ('Checkout', 'Reserved')  [["email", "abc@abc"]]
INSERT INTO "reservations" ("email", "lpn", "expect_start_time", "expect_return_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "reservations" SET "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["status", "Reserved"], ["updated_at", "2017-09-24 15:17:34.548058"], ["id", 54]]
SELECT  "cars".* FROM "cars" WHERE "cars"."lpn" = ? LIMIT ?  [["lpn", "123"], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Reserved"], ["updated_at", "2017-09-24 14:17:17.516886"], ["id", 8]]

  def create_rent
    @reservation = Reservation.new(reservation_params)
    @reservation.checkout_time = Time.now
    @reservation.status = 'Checkout'
    respond_to do |format|
      user = User.find_by_email(@reservation.email)
      if !user
        format.html {redirect_to reserve_path(:reserve => {:lpn => @reservation.lpn}), notice: 'Customer does not exist'}
      else
        @reservation1 = Reservation.where(email: user.email).where(status: ["Checkout", "Reserved"])
        if @reservation1 != []
          format.html {redirect_to cars_url, notice: "The customer already has one reservation."}
        end
      end

      if user && @reservation1 == [] && @reservation.save
        return_timer @reservation.expect_return_time, @reservation.id, @reservation.lpn
        @reservation.update_attribute(:expect_start_time, Time.now)
        @car = Car.find_by_lpn(@reservation.lpn)
        @car.update_attribute(:status, "Checkout")
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "abc@abc"], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ? AND "reservations"."status" IN ('Checkout', 'Reserved')  [["email", "abc@abc"]]
INSERT INTO "reservations" ("email", "lpn", "expect_start_time", "checkout_time", "expect_return_time", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "reservations" SET "checkout_time" = ?, "status" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["checkout_time", "2017-10-02 22:51:09.667366"], ["status", "Checkout"], ["updated_at", "2017-10-02 22:51:04.671842"], ["id", 102]]
SELECT  "cars".* FROM "cars" WHERE "cars"."lpn" = ? LIMIT ?  [["lpn", "567"], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Checkout"], ["updated_at", "2017-10-02 22:51:04.730385"], ["id", 5]]

  def history
    lpn = params[:car][:carlpn]
    @reservations = Reservation.where(lpn: lpn)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ? LIMIT ?  [["lpn", "12345"], ["LIMIT", 1]]

  def create
    @car = Car.new(car_params)
    @car.status = "Available"
    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("lpn", "manufactuere", "model", "hrr", "style", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["lpn", "123"], ["manufactuere", "abc"], ["model", "abc"], ["hrr", 10.2], ["style", "abc"], ["created_at", "2017-09-22 23:16:46.429081"], ["updated_at", "2017-09-22 23:16:46.429081"]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "location" = ?, "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["location", "Raleigh"], ["status", "Available"], ["updated_at", "2017-09-22 23:42:57.540231"], ["id", 2]]

  def destroy
    # @car.destroy
    car_lpn = @car.lpn
    reservation = Reservation.where(lpn: car_lpn).where(status: "Checkout")
    if reservation != []
      respond_to do |format|
        format.html {redirect_to cars_url, notice: "Can't delete a car currently checked out!"}
      end
    else
      reservation = Reservation.where(lpn: car_lpn)
      reservation.each do |r|
        r.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ? AND "reservations"."status" = ?  [["lpn", "123"], ["status", "Checkout"]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ?  [["lpn", "123"]]
DELETE FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]

  def checkout
    lpn = params[:reservation][:lpn]
    @reservation = Reservation.where(:lpn => lpn).where(:status => "Reserved").first
    current_time = Time.now
    if current_time < @reservation.expect_start_time
      respond_to do |format|
        format.html {redirect_to customer_reservation_path(:customer => {:email => @reservation.email}), notice: "Can't checkout a car before your checkout time."}
      end
    else
      return_timer @reservation.expect_return_time, @reservation.id, @reservation.lpn
      @reservation.update_attribute(:checkout_time, current_time)
      @reservation.update_attribute(:status, "Checkout")

      @car = Car.find_by_lpn(lpn)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ? AND "reservations"."status" = ? ORDER BY "reservations"."id" ASC LIMIT ?  [["lpn", "123"], ["status", "Reserved"], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Checkout"], ["updated_at", "2017-09-24 16:41:07.618548"], ["id", 10]]
UPDATE "reservations" SET "checkout_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["checkout_time", "2017-09-24 16:40:43.613503"], ["updated_at", "2017-09-24 16:40:43.614559"], ["id", 54]]
SELECT  "cars".* FROM "cars" WHERE "cars"."lpn" = ? LIMIT ?  [["lpn", "12345"], ["LIMIT", 1]]

  def return_car
    lpn = params[:reservation][:lpn]
    @reservation = Reservation.where(:lpn => lpn).where(:status => "Checkout").first
    current_time = Time.now
    @reservation.update_attribute(:return_time, current_time)
    @reservation.update_attribute(:status, "Returned")

    @car = Car.find_by_lpn(lpn)
    # if @car.status == "Checkout"
    @car.update_attribute(:status, "Available")
    car_hrr = @car.hrr
    rental_time = (@reservation.return_time - @reservation.checkout_time)/3600
    @reservation.update_attribute(:charge, (car_hrr*rental_time).round(2))
    user_email = @reservation.email
    user = User.find_by_email(user_email)
    if user.rental_charge == nil
      rental_charge = 0
    else
      rental_charge = user.rental_charge
    end

    rental_charge += car_hrr*rental_time
    user.update_attribute(:rental_charge, rental_charge.round(2))
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ? AND "reservations"."status" = ? ORDER BY "reservations"."id" ASC LIMIT ?  [["lpn", "123"], ["status", "Checkout"], ["LIMIT", 1]]
UPDATE "reservations" SET "return_time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["return_time", "2017-09-24 22:16:50.962237"], ["updated_at", "2017-09-24 22:16:50.963040"], ["id", 50]]
SELECT  "cars".* FROM "cars" WHERE "cars"."lpn" = ? LIMIT ?  [["lpn", "123"], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2017-09-24 22:17:43.112866"], ["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "abc@abc"], ["LIMIT", 1]]
UPDATE "users" SET "rental_charge" = ? WHERE "users"."id" = ?  [["rental_charge", 5.7], ["id", 14]]