app/controllers/customers_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authority" = ?  [["authority", "customer"]]
---
  def index
    @customers = User.where(:authority => 'customer')

INSERT INTO "users" ("email", "name", "password_digest", "authority") VALUES (?, ?, ?, ?)  [["email", "abc@abc"], ["name", "james"], ["password_digest", "$2a$10$QkpMkK/Jwp/4Dfdfl.VTHO4nE9zfMIIFZzdT0IiDW.2j8Jix4c5qa"], ["authority", "super"]]
---
  def create
    @customer = User.new(customer_params)
    @customer.authority = 'customer'
    respond_to do |format|
      if @customer.save

SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ? AND "reservations"."status" = ?  [["email", "abc@abc"], ["status", "Checkout"]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."email" = ?  [["email", "abc@abc"]]
---
  def destroy
    email = @customer.email
    reservation = Reservation.where(email: email).where(status: "Checkout")
    if reservation != []
      respond_to do |format|
        format.html {redirect_to customers_url, notice: "Can't delete this customer as he/she still has a car checked out!"}
        return
      end
    else
      reservations = Reservation.where(email: email)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."email" = ? LIMIT ?  [["email", "abc@abc"], ["LIMIT", 1]]
---
  def reservation
    email = params[:customer][:email]
    @reservations = Reservation.where(email: email)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."email" = ? LIMIT ?  [["email", "abc@abc"], ["LIMIT", 1]]
---
  def history
    email = params[:customer][:email]
    @reservations = Reservation.where(email: email)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."lpn" = ? AND "reservations"."status" = ? ORDER BY "reservations"."id" ASC LIMIT ?  [["lpn", "234"], ["status", "Reserved"], ["LIMIT", 1]]
SELECT  "cars".* FROM "cars" WHERE "cars"."lpn" = ? LIMIT ?  [["lpn", "234"], ["LIMIT", 1]]
UPDATE "cars" SET "status" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["status", "Available"], ["updated_at", "2017-09-30 19:22:03.271595"], ["id", 6]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 68]]
---
  def cancel
    lpn = params[:reservation][:lpn]
    reservation = Reservation.where(lpn: lpn).where(status: "Reserved").first
    car = Car.find_by_lpn(lpn)
    car.update_attribute(:status , "Available")
    reservation.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def set_customer
    @customer = User.find(params[:id])