app/controllers/superadmins_controller.rb

SELECT "users".* FROM "users" WHERE "users"."authority" = ?  [["authority", "super"]]
---
  def index
    @superadmins = User.where(:authority => 'super')

INSERT INTO "users" ("email", "name", "password_digest", "authority") VALUES (?, ?, ?, ?)  [["email", "123@123"], ["name", "123"], ["password_digest", "$2a$10$yHHa2AxMzHhsB1kG51zmsubqKipuQKh8TDR829YaHdzSLMiyFmzRC"], ["authority", "super"]]
---
  def create
    @superadmin = User.new(superadmin_params)
    @superadmin.authority = 'super'
    respond_to do |format|
      if @superadmin.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_superadmin
    @superadmin = User.find(params[:id])