app/controllers/superadmins_controller.rb

  def index
    @superadmins = Superadmin.all
---
SELECT "superadmins".* FROM "superadmins"

  def create
    @superadmin = Superadmin.new(superadmin_params)

    respond_to do |format|
      if @superadmin.save
---
INSERT INTO "superadmins" ("password_digest", "name", "email") VALUES (?, ?, ?)  [["password_digest", "$2a$10$uKHEarc1vpxpP7DiqON/0eG07y4TMKlfPXkLbIWqUIqeG4FF7LYC."], ["name", "asd"], ["email", "asd@123"]]

  def update
    respond_to do |format|
      if @superadmin.update(superadmin_params)
---
UPDATE "superadmins" SET "password" = ? WHERE "superadmins"."id" = ?  [["password", "1"], ["id", 2]]

  def destroy
    @superadmin.destroy
---
DELETE FROM "superadmins" WHERE "superadmins"."id" = ?  [["id", 1]]

    def set_superadmin
      @superadmin = Superadmin.find(params[:id])
---
SELECT  "superadmins".* FROM "superadmins" WHERE "superadmins"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]