app/views/cars/_rent_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."authority" = ?  [["authority", "customer"]]
---
        <%= f.label :email, "Customer Email" %>
        <% options = options_from_collection_for_select(User.where(:authority => 'customer'),'email','email') %>